app/controllers/admin_controller.rb

SELECT  "honoraires".* FROM "honoraires"  WHERE "honoraires"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "specialites".* FROM "specialites"  WHERE "specialites"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
  	@index = Index.find(1)
  	@honoraire = Honoraire.find(1)
  	@contact = Contact.find(1)
  	@specialite = Specialite.find(1)

SELECT  "veilles".* FROM "veilles"  WHERE (langue = 'fr')  ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "veilles"  WHERE (langue = 'fr')
---
  def actualite
  	@veilles = Veille.where("langue = '#{I18n.locale}'").order('updated_at DESC').paginate(:page => params[:page])

SELECT  "veilles".* FROM "veilles"  WHERE "veilles"."id" = ? LIMIT 1  [["id", 30]]
UPDATE "veilles" SET "texte" = ?, "titre" = ?, "updated_at" = ? WHERE "veilles"."id" = 19
---
  def update_actualite
  	begin
	  	veille = Veille.find(params[:id])
	rescue Exception => e
		redirect_to user_actualite_path, :flash => { :alert => "l'actualité cherché n'a pas été trouvée." } and return
	end
	veille.titre = params[:titre]
	veille.texte = params[:texte]
	begin
	  	veille.save

SELECT  "veilles".* FROM "veilles"  WHERE "veilles"."id" = ? LIMIT 1  [["id", 20]]
DELETE FROM "veilles" WHERE "veilles"."id" = ?  [["id", 20]]
---
  def delete_actualite
  	begin
	  	veille = Veille.find(params[:id])
	rescue Exception => e
		redirect_to user_actualite_path, :flash => { :alert => "l'actualité cherché n'a pas été trouvée." } and return
	end
	begin
	  	veille.destroy

SELECT  "associes".* FROM "associes"   ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "associes"
---
  def associe
  	@associes = Associe.all.order('updated_at DESC').paginate(:page => params[:page])