app/controllers/home_controller.rb

  def index
       @index = Index.find(1)
       if I18n.locale == :en
         @map = @index.streeten
       else
         @map = @index.street
       end
       @veilles = Veille.where("langue = '#{I18n.locale}'").order('updated_at DESC').limit(3)
---
SELECT  "veilles".* FROM "veilles"  WHERE (langue = 'fr')  ORDER BY updated_at DESC LIMIT 3

  def associe
    @associes = Associe.all.order('updated_at DESC').paginate(:page => params[:page])
---
SELECT  "associes".* FROM "associes"   ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "associes"

  def honoraire
        @honoraire = Honoraire.find(1)
---
SELECT  "honoraires".* FROM "honoraires"  WHERE "honoraires"."id" = ? LIMIT 1  [["id", 1]]

  def contact
        @contact = Contact.find(1)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 1]]

  def specialite
        @specialite = Specialite.find(1)
---
SELECT  "specialites".* FROM "specialites"  WHERE "specialites"."id" = ? LIMIT 1  [["id", 1]]

  def actualite
  	@veilles = Veille.where("langue = '#{I18n.locale}'").order('updated_at DESC').paginate(:page => params[:page])
---
SELECT  "veilles".* FROM "veilles"  WHERE (langue = 'en' and veille_type = 0)  ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "veilles"  WHERE (langue = 'en' and veille_type = 0)