app/controllers/home_controller.rb

SELECT  "veilles".* FROM "veilles"  WHERE (langue = 'en')  ORDER BY updated_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "veilles"  WHERE (langue = 'en')
---
  def veille
  	@veilles = Veille.all.order('updated_at DESC').paginate(:page => params[:page])